server/app/controllers/accounts_controller.rb

  def show

    @account_portfolios = Portfolio.all.where("account_id = #{params[:id]}" )
    @account_transactions = Transaction.all.where("account_id = #{params[:id]}")
---
SELECT "transactions".* FROM "transactions" WHERE (account_id = 1)

    def set_account
      @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]