server/app/controllers/accounts_controller.rb

SELECT "users".* FROM "users"
SELECT "accounts".* FROM "accounts"
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1  [["account_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE (account_id = 3)
---
  def leaderboard

    @users = User.all;
    @accounts = Account.all;
    @portfolios = Portfolio.all;

    leaderboard_data = {}

    @accounts.each do |account|

      email = @users.find_by(id: account.user_id)
      stockListArray = ["cash balance"]
      stockMarketValueArray = [account.cash_balance]
      account_portfolios = @portfolios.where(account_id: account.id)

SELECT "accounts".* FROM "accounts"
SELECT "users".* FROM "users"
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1  [["account_id", 2]]
---
  def index
    adjust_accounts_balance_from_updated_portfolios

    @accounts = Account.all
    @users = User.all
    @portfolios = Portfolio.all

SELECT "portfolios".* FROM "portfolios"
SELECT "accounts".* FROM "accounts"
SELECT "portfolios".* FROM "portfolios" WHERE (account_id = 2)
UPDATE "portfolios" SET "current_spot_price" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["current_spot_price", 4484.7485], ["updated_at", "2021-11-25 15:04:19.489333"], ["id", 2]]
UPDATE "accounts" SET "stock_balance" = $1, "total_balance" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["stock_balance", 9734], ["total_balance", 9739], ["updated_at", "2021-11-24 16:03:22.441954"], ["id", 4]]
---
  def leaderboard

    @users = User.all;
    @accounts = Account.all;
    @portfolios = Portfolio.all;

    leaderboard_data = []

    @accounts.each do |account|

      email = @users.find_by(id: account.user_id)
      stockListArray = ["cash balance"]
      stockMarketValueArray = [account.cash_balance]
      account_portfolios = @portfolios.where(account_id: account.id)

      puts account_portfolios.inspect

      account_portfolios.each do |portfolio|
        stockListArray.push(portfolio.ticker)
        stockMarketValueArray.push(portfolio.quantity * portfolio.current_spot_price)

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1  [["account_id", 2]]
SELECT "transactions".* FROM "transactions" WHERE (account_id = 3)
---
  def show

    #update the portfolio spot price
    adjust_accounts_balance_from_updated_portfolios

    #update the account balance based on new spot price

    @account_portfolios = Portfolio.all.where("account_id = #{params[:id]}" )
    @account_transactions = Transaction.all.where("account_id = #{params[:id]}")

UPDATE "accounts" SET "stock_balance" = $1, "total_balance" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["stock_balance", 9967.3485], ["total_balance", 11967.3485], ["updated_at", "2021-11-25 19:30:05.539524"], ["id", 1]]
---
  def update
    if @account.update(account_params)

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1  [["account_id", 1]]
---
  def adjust_portfolio_spot_price


    @live_price = get_live_price
    @portfolios = Portfolio.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_account
      @account = Account.find(params[:id])