server/app/controllers/accounts_controller.rb

  def adjust_portfolio_spot_price
    @live_price = get_live_price
    @portfolios = Portfolio.all
    @portfolios.each do |portfolio|
      if !@live_price[portfolio.ticker].nil?
        portfolio.current_spot_price = @live_price[portfolio.ticker]
        portfolio.save
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1  [["account_id", 3]]
UPDATE "portfolios" SET "current_spot_price" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["current_spot_price", 58978.66], ["updated_at", "2021-11-25 20:15:24.315507"], ["id", 10]]

  def get_all_stocks
    stocks_list = []
    stocks_string = ""
    serialized_string = ""

    # find distinct stocks from portfolio
    @distinct_stocks = Portfolio.select(:ticker).distinct
---
SELECT DISTINCT "portfolios"."ticker" FROM "portfolios"