server/app/controllers/portfolios_controller.rb

  def index
    adjust_portfolios_spot_price

    @portfolios = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

  def adjust_portfolios_spot_price
    @live_price = get_live_price
    @portfolios = Portfolio.all
    @portfolios.each do |portfolio|
      if !@live_price[portfolio.ticker].nil?
        portfolio.current_spot_price = @live_price[portfolio.ticker]
        portfolio.save
---
SELECT "portfolios".* FROM "portfolios"
UPDATE "portfolios" SET "current_spot_price" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["current_spot_price", 160], ["updated_at", "2021-11-24 16:04:24.836876"], ["id", 1]]

    def get_all_stocks
      stocks_list = []
      stocks_string = ""
      serialized_string = ""
      # find distinct stocks from portfolio
      @distinct_stocks = Portfolio.select(:ticker).distinct
---
SELECT DISTINCT "portfolios"."ticker" FROM "portfolios"