server/app/controllers/transactions_controller.rb

  def create
    puts "%%%receving post request from front end%%%%"

    trade_type = transaction_params[:trade]
    settled_price = transaction_params[:settled_price]
    quantity = transaction_params[:quantity]
    ticker = transaction_params[:ticker]
    account_id = transaction_params[:account_id]

    puts transaction_params

    account_to_modify = Account.find_by(id: account_id)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]