server/app/controllers/transactions_controller.rb


    @transaction = Transaction.new(transaction_params)

    if @transaction.save
---
INSERT INTO "transactions" ("ticker", "trade", "quantity", "settled_price", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["ticker", "CDS"], ["trade", 1], ["quantity", 1], ["settled_price", 155], ["created_at", "2021-11-22 22:06:41.908179"], ["updated_at", "2021-11-22 22:06:41.908179"], ["account_id", 1]]