server/app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."ticker" = $2 LIMIT $3  [["account_id", 1], ["ticker", "AAPL"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."ticker" = $2 AND "transactions"."trade" = $3  [["account_id", 1], ["ticker", "AAPL"], ["trade", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."ticker" = $2 AND "transactions"."trade" = $3  [["account_id", 1], ["ticker", "AAPL"], ["trade", -1]]
SELECT SUM() FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."ticker" = $2 AND "transactions"."trade" = $3  [["account_id", 1], ["ticker", "AAPL"], ["trade", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."ticker" = $2 AND "transactions"."trade" = $3  [["account_id", 1], ["ticker", "AAPL"], ["trade", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."ticker" = $2 AND "transactions"."trade" = $3  [["account_id", 1], ["ticker", "A"], ["trade", -1]]
---
  def create
    puts "%%%receving post request from front end%%%%"

    trade_type = transaction_params[:trade]
    settled_price = transaction_params[:settled_price]
    quantity = transaction_params[:quantity]
    ticker = transaction_params[:ticker]
    account_id = transaction_params[:account_id]

    account_to_modify = Account.find_by(id: account_id)

    # calculate qty of ticker
    buys = Transaction.where(account_id: account_id, ticker: ticker, trade: "1")
    sells = Transaction.where(account_id: account_id, ticker: ticker, trade: "-1")

    total_buys = buys.sum do |item|
      item.quantity * item.trade
    end

    total_sells = sells.sum do |item|

UPDATE "accounts" SET "cash_balance" = $1, "stock_balance" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["cash_balance", 9838], ["stock_balance", 161], ["updated_at", "2021-11-24 17:42:09.739314"], ["id", 5]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1 AND "portfolios"."ticker" = $2 LIMIT $3  [["account_id", 5], ["ticker", "AAPL"], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1 AND "portfolios"."ticker" = $2 LIMIT $3  [["account_id", 2], ["ticker", "SHOP"], ["LIMIT", 1]]
---
    new_stock_balance = account_to_modify.stock_balance + settled_price * quantity * trade_type

    # modify account
    account_to_modify.update({:cash_balance => new_cash_balance, :stock_balance => new_stock_balance })

    # check if portfolio exists
    if Portfolio.find_by(account_id: account_id, ticker: ticker)
      puts "****** portfolio exists. Update or destroy ******"
      account_portfolio = Portfolio.find_by(account_id: account_id, ticker: ticker)

UPDATE "accounts" SET "cash_balance" = $1, "stock_balance" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["cash_balance", 7637.25], ["stock_balance", 2352.1399999999994], ["updated_at", "2021-11-24 19:53:07.909904"], ["id", 2]]
UPDATE "portfolios" SET "quantity" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["quantity", 2.0], ["updated_at", "2021-11-24 18:39:21.118347"], ["id", 3]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 3]]
---
      new_quantity = account_portfolio.quantity + quantity * trade_type

      # update inc/dec qty
      account_portfolio.update(quantity: new_quantity)

      # destroy if 0 qty
      if new_quantity == 0
        account_portfolio.destroy

INSERT INTO "portfolios" ("ticker", "quantity", "current_spot_price", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ticker", "AAPL"], ["quantity", 1.0], ["current_spot_price", 161], ["created_at", "2021-11-24 17:42:09.759753"], ["updated_at", "2021-11-24 17:42:09.759753"], ["account_id", 5]]
INSERT INTO "transactions" ("ticker", "trade", "quantity", "settled_price", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["ticker", "AAPL"], ["trade", 1], ["quantity", 1.0], ["settled_price", 161], ["created_at", "2021-11-24 17:42:09.771654"], ["updated_at", "2021-11-24 17:42:09.771654"], ["account_id", 5]]
---
    else
      puts "****** No portfolio. Create new****"
      # create
      Portfolio.create({ticker: ticker, quantity: quantity, current_spot_price: settled_price, account_id: account_id})
    end

    if @transaction.save