server/app/controllers/users_controller.rb

  def login
    user = User.find_by(email: user_params[:email].to_s.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "aaron@gmail.com"], ["LIMIT", 1]]

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    signup_referral_code = user_params[:referral_code].strip

    if signup_referral_code == ''
      @user = User.new(user_params)
      @user.save
      @user.accounts.create!({
        :cash_balance => 10000,
        :stock_balance => 0,
        :signup_bonus => false,
        :referral_bonus => 0,
        :total_balance => 10000,
      })
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "referral_code") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "accounts" ("cash_balance", "stock_balance", "total_balance", "created_at", "updated_at", "user_id", "referral_bonus", "signup_bonus") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"


    # create referral code - replace used code with new user code to store in db
    user_referral_code = SecureRandom.alphanumeric(6)
    @user.update(referral_code: user_referral_code)

    if @user.save
---
UPDATE "users" SET "updated_at" = $1, "referral_code" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-11-24 17:37:04.936809"], ["referral_code", "ouTTQh"], ["id", 5]]

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]