server/app/models/transaction.rb

    ticker = self.ticker

    # get the account
    account_to_modify = Account.find_by(id: account_id)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    new_stock_balance = account_to_modify.stock_balance + settled_price * quantity * trade_type

    # modify account
    account_to_modify.update({:cash_balance => new_cash_balance, :stock_balance => new_stock_balance })

    # check if portfolio exists
    if Portfolio.find_by(account_id: account_id, ticker: ticker)
      puts "****** portfolio exists. Update or destroy ******"
      account_portfolio = Portfolio.find_by(account_id: account_id, ticker: ticker)
---
UPDATE "accounts" SET "cash_balance" = $1, "stock_balance" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["cash_balance", 1845], ["stock_balance", 9721], ["updated_at", "2021-11-22 16:57:51.503818"], ["id", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1 AND "portfolios"."ticker" = $2 LIMIT $3  [["account_id", 1], ["ticker", "CDS"], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."account_id" = $1 AND "portfolios"."ticker" = $2 LIMIT $3  [["account_id", 1], ["ticker", "AAPL"], ["LIMIT", 1]]

      new_quantity = account_portfolio.quantity + quantity * trade_type

      # update inc/dec qty
      account_portfolio.update(quantity: new_quantity)

      # destroy if 0 qty
      if new_quantity == 0
        account_portfolio.destroy
---
UPDATE "accounts" SET "cash_balance" = $1, "stock_balance" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["cash_balance", 1690], ["stock_balance", 9876], ["updated_at", "2021-11-22 20:50:21.659517"], ["id", 1]]
UPDATE "portfolios" SET "quantity" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["quantity", -1], ["updated_at", "2021-11-22 22:10:17.877893"], ["id", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 1]]

    else
      puts "****** No portfolio. Create new****"
      # create
      Portfolio.create({ticker: ticker, quantity: quantity, current_spot_price: settled_price, account_id: account_id})
---
INSERT INTO "portfolios" ("ticker", "quantity", "current_spot_price", "created_at", "updated_at", "account_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ticker", "CDS"], ["quantity", 1], ["current_spot_price", 155], ["created_at", "2021-11-22 22:09:26.715465"], ["updated_at", "2021-11-22 22:09:26.715465"], ["account_id", 1]]