server/app/models/user.rb

  def downcase_email
    self.email = self.email.delete(' ').downcase
  end


  #need after_create to create account for new user and give 10000 for starting

  after_create do
    #check if the account is in the seeds or not, if not in seeds create a new account
    puts "&&&&&checking after_create_operation&&&&&&"

    self.accounts.create!({
      :cash_balance => 10000,
      :stock_balance => 0,
      :total_balance => 10000,
      :referral_bonus => 0,
      :signup_bonus => false
    })
---
INSERT INTO "accounts" ("cash_balance", "stock_balance", "total_balance", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cash_balance", 10000], ["stock_balance", 0], ["total_balance", 10000], ["created_at", "2021-11-23 21:33:23.684342"], ["updated_at", "2021-11-23 21:33:23.684342"], ["user_id", 5]]